units = ["", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять",
         "десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать",
         "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"]
tens = ["", "", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят","девяносто"]
hundreds = ["", "сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"]
a = int(input())
if a == 1000:
    print("тысяча")
else:
    u = a % 10
    t = a // 10 % 10
    h = a // 100
    word = hundreds[h]
    if t == 1:
        if h != 0:
            word += " "
        word += units[t * 10 + u]
    else:
        if h != 0:
            word += " "
        word += tens[t]
        if t != 0:
            word += " "
        word += units[u]
    print(word)